In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-03-01', periods=24),
    'Product': ['X', 'Y', 'Z', 'X', 'Y', 'Z'] * 4,
    'Region': [
        'North', 'South', 'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South', 'East', 'West',
        'North', 'South', 'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South', 'East', 'West'
    ],
    'Sales': np.random.randint(150, 1200, 24),
    'Units': np.random.randint(5, 60, 24),
    'Rep': [
        'Amit', 'Neha', 'Rohit', 'Pooja', 'Amit', 'Neha',
        'Rohit', 'Pooja', 'Amit', 'Neha', 'Rohit', 'Pooja',
        'Amit', 'Neha', 'Rohit', 'Pooja', 'Amit', 'Neha',
        'Rohit', 'Pooja', 'Amit', 'Neha', 'Rohit', 'Pooja'
    ]
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

df

         Date Product Region  Sales  Units    Rep  Month Quarter
0  2023-03-01       X  North    218     44   Amit  March      Q1
1  2023-03-02       Y  South    802     42   Neha  March      Q1
2  2023-03-03       Z   East    965     14  Rohit  March      Q1
3  2023-03-04       X   West    606     37  Pooja  March      Q1
4  2023-03-05       Y  North    533     50   Amit  March      Q1
5  2023-03-06       Z  South    163     38   Neha  March      Q1
6  2023-03-07       X   East    240     50  Rohit  March      Q1
7  2023-03-08       Y   West    572     51  Pooja  March      Q1
8  2023-03-09       Z  North    352     33   Amit  March      Q1
9  2023-03-10       X  South    976     31   Neha  March      Q1
10 2023-03-11       Y   East    946      6  Rohit  March      Q1
11 2023-03-12       Z   West    573     27  Pooja  March      Q1
12 2023-03-13       X  North   1067     57   Amit  March      Q1
13 2023-03-14       Y  South    718     17   Neha  March      Q1
14 2023-03-15       Z   East    383     11  Rohit  March      Q1
15 2023-03-16       X   West   1055     19  Pooja  March      Q1
16 2023-03-17       Y  North    533     11   Amit  March      Q1
17 2023-03-18       Z  South    383     10   Neha  March      Q1
18 2023-03-19       X   East    861     58  Rohit  March      Q1
19 2023-03-20       Y   West    907     17  Pooja  March      Q1
20 2023-03-21       Z  North    810     12   Amit  March      Q1
21 2023-03-22       X  South   1009     51   Neha  March      Q1
22 2023-03-23       Y   East    879     50  Rohit  March      Q1
23 2023-03-24       Z   West    641     13  Pooja  March      Q1

In [7]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product')

Product      X      Y      Z
Region
East     550.5  912.5  674.0
North    642.5  533.0  581.0
South    992.5  760.0  273.0
West     830.5  739.5  607.0

In [8]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc='median')

Product      X      Y      Z
Region
East     550.5  912.5  674.0
North    642.5  533.0  581.0
South    992.5  760.0  273.0
West     830.5  739.5  607.0

In [15]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales               Units
Product      X      Y      Z     X     Y     Z
Region
East     550.5  912.5  674.0  54.0  28.0  12.5
North    642.5  533.0  581.0  50.5  30.5  22.5
South    992.5  760.0  273.0  41.0  29.5  24.0
West     830.5  739.5  607.0  28.0  34.0  20.0

In [18]:
#CROSS TABLE
pd.crosstab(df['Region'], df['Product']) # crosstav is used for counting purpose

Product  X  Y  Z
Region
East     2  2  2
North    2  2  2
South    2  2  2
West     2  2  2